Documents/ИнвойсПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ИнвойсПродажи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проформа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезервироватьТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыИнвойса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ВидыИнвойса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проформа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвойс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИнвойсПродажи/Ext/ManagerModule.bsl
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	Возврат Новый Структура("Метреон, Форма1, Форма2, Bennu, Metreon", 
							НСтр("ru='Метреон-';en='Metreon-'"), 
							НСтр("ru='Форма #1';en='Form #1'"), 
							НСтр("ru='Форма #2';en='Form #2'"),
							НСтр("ru='Bennu';en='Bennu'"),
							НСтр("ru='Metreon';en='Metreon'")
							);		

КонецФункции 

Процедура ПечатьДокумента_(ДокСсылка, Поз, ТабДокумент, Парам=Неопределено) Экспорт
	
	ТабДокумент.Очистить();
	Макет = Документы.ИнвойсПродажи.ПолучитьМакет("Метреон");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнвойсПродажи.Номер,
	               |	ИнвойсПродажи.Дата,
	               |	ИнвойсПродажи.Сумма,
	               |	ИнвойсПродажи.Валюта,
	               |	ИнвойсПродажи.Валюта.Символ КАК Символ,
	               |	ИнвойсПродажи.Фирма,
	               |	ИнвойсПродажи.Примечание,
	               |	ВЫБОР
	               |		КОГДА ИнвойсПродажи.Контрагент.ПолнНаименование = """"
	               |			ТОГДА ИнвойсПродажи.Контрагент.Наименование
	               |		ИНАЧЕ ИнвойсПродажи.Контрагент.ПолнНаименование
	               |	КОНЕЦ КАК Контрагент,
	               |	ИнвойсПродажи.Контрагент.Телефоны КАК Телефон,
	               |	ИнвойсПродажи.Контрагент.Адрес КАК Адрес,
	               |	ИнвойсПродажи.Контрагент.Email КАК Email,
	               |	ИнвойсПродажи.Контрагент.Доставка КАК Доставка,
	               |	ИнвойсПродажи.Счет.РеквизитыДляПечати КАК РеквизитыСчета,
	               |	ВЫБОР
	               |		КОГДА ИнвойсПродажи.Проформа = ЗНАЧЕНИЕ(Перечисление.ВидыИнвойса.Проформа)
	               |			ТОГДА ""PROFORMA INVOICE""
	               |		ИНАЧЕ ""INVOICE""
	               |	КОНЕЦ КАК Проформа,
	               |	ИнвойсПродажи.Доставка,
	               |	ИнвойсПродажи.Сумма - ИнвойсПродажи.Доставка КАК СуммаТоваров
	               |ИЗ
	               |	Документ.ИнвойсПродажи КАК ИнвойсПродажи
	               |ГДЕ
	               |	ИнвойсПродажи.Ссылка = &Ссылка";
    Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнвойсПродажиТовары.НомерСтроки КАК НомерСтроки,
	               |	ИнвойсПродажиТовары.Номенклатура,
	               |	ИнвойсПродажиТовары.Количество,
	               |	ИнвойсПродажиТовары.Цена,
	               |	ИнвойсПродажиТовары.Сумма
	               |ИЗ
	               |	Документ.ИнвойсПродажи.Товары КАК ИнвойсПродажиТовары
	               |ГДЕ
	               |	ИнвойсПродажиТовары.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки"; 

	ЗапросТовары = Запрос.Выполнить().Выгрузить();
	
	глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка);
	
	ОбластьМакета 		= Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаЧет 	= Макет.ПолучитьОбласть("СтрокаЧет"); 
	Ном = 0;
	Для Каждого ВыбСтрока Из ЗапросТовары Цикл
		Ном = Ном + 1;
		Если Ном/2 = Цел(Ном/2) Тогда
			ОбластьМакетаЧет.Параметры.Заполнить(ВыбСтрока); 
			ОбластьМакетаЧет.Параметры.СимволВалюты = Шапка.Символ; 
			ТабДокумент.Вывести(ОбластьМакетаЧет);
		Иначе
		ОбластьМакета.Параметры.Заполнить(ВыбСтрока); 
		ОбластьМакета.Параметры.СимволВалюты = Шапка.Символ; 
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
	КонецЦикла;   
	
	ОбластьМакета = Макет.ПолучитьОбласть("Дно");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	//ОбластьМакета.Параметры.Сумма				= Продукты.Итог("Сумма");
	//ОбластьМакета.Параметры.Количество			= Продукты.Итог("Количество");
	//ОбластьМакета.Параметры.СуммаПрописью 		= ЧислоПрописью(Продукты.Итог("Сумма"), "Л = uk_UA", "гривня,гривни,гривень,ж,копійка,копійки,копійок,м");
	//ОбластьМакета.Параметры.КоличествоПрописью 	= ЧислоПрописью(Продукты.Итог("Количество"), "Л = uk_UA", ",,,ж,,,,,0");
	ТабДокумент.Вывести(ОбластьМакета);

КонецПроцедуры

Процедура ПечатьДокумента(ДокСсылка, ВариантПечатнойФормы, ТабДокумент, Параметры = 0) Экспорт
	
	ТабДокумент.Очистить();
	Макет = Документы.ИнвойсПродажи.ПолучитьМакет(ВариантПечатнойФормы);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПредставлениеДокумента",  ОбщегоНазначения.ПредставлениеДокументаДляПечати(ДокСсылка, ПолучитьСтруктуруПечатныхФорм()[ВариантПечатнойФормы]));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнвойсПродажи.Номер КАК Номер,
	               |	ИнвойсПродажи.Дата КАК Дата,
	               |	&ПредставлениеДокумента КАК ПредставлениеДокумента,
	               |	ИнвойсПродажи.Валюта КАК Валюта,
	               |	ИнвойсПродажи.Валюта.Символ КАК Символ,
	               |	ИнвойсПродажи.Счет КАК Счет,
	               |	ИнвойсПродажи.Доставка КАК Доставка,
	               |	ИнвойсПродажи.Сумма КАК Сумма,
	               |	ИнвойсПродажи.КемСохранен КАК Автор,
	               |	ИнвойсПродажи.Счет.РеквизитыДляПечати КАК РеквизитыСчета,
	               |	ИнвойсПродажи.СчетДополнительный.РеквизитыДляПечати КАК РеквизитыСчетаДоп,
	               |	ВЫБОР
	               |		КОГДА ИнвойсПродажи.Контрагент.ПолнНаименование = """"
	               |			ТОГДА ИнвойсПродажи.Контрагент.Наименование
	               |		ИНАЧЕ ИнвойсПродажи.Контрагент.ПолнНаименование
	               |	КОНЕЦ КАК Контрагент,
	               |	ИнвойсПродажи.Контрагент.Телефоны КАК ТелефонКонтрагента,
	               |	ИнвойсПродажи.Контрагент.Адрес КАК АдресКонтрагента,
	               |	ИнвойсПродажи.Контрагент.Email КАК ПочтаКонтрагента,
	               |	ВЫБОР
	               |		КОГДА ИнвойсПродажи.Получатель.ПолнНаименование = """"
	               |			ТОГДА ИнвойсПродажи.Получатель.Наименование
	               |		ИНАЧЕ ИнвойсПродажи.Получатель.ПолнНаименование
	               |	КОНЕЦ КАК Получатель,
	               |	ИнвойсПродажи.Получатель.Телефоны КАК ТелефонПолучателя,
	               |	ИнвойсПродажи.Получатель.Адрес КАК АдресПолучателя,
	               |	ИнвойсПродажи.Получатель.Email КАК ПочтаПолучателя,
	               |	ВЫБОР
	               |		КОГДА ИнвойсПродажи.Проформа = ЗНАЧЕНИЕ(Перечисление.ВидыИнвойса.Проформа)
	               |			ТОГДА ""PROFORMA INVOICE""
	               |		ИНАЧЕ ""INVOICE""
	               |	КОНЕЦ КАК Проформа,
	               |	ИнвойсПродажи.Сумма - ИнвойсПродажи.Доставка КАК СуммаТоваров,
	               |	ВЫРАЗИТЬ(ИнвойсПродажи.Примечание КАК СТРОКА(1000)) КАК Примечание,
	               |	ИнвойсПродажи.Фирма.Адрес КАК АдресФирмы,
	               |	ИнвойсПродажи.Фирма.Телефоны КАК ТелефонФирмы,
	               |	ИнвойсПродажи.Фирма.Email КАК ПочтаФирмы,
	               |	ИнвойсПродажи.Фирма.ПолнНаименование КАК НаименованиеФирмы,
	               |	ИнвойсПродажи.Менеджер КАК Менеджер,
	               |	ИнвойсПродажи.Количество КАК Количество
	               |ИЗ
	               |	Документ.ИнвойсПродажи КАК ИнвойсПродажи
	               |ГДЕ
	               |	ИнвойсПродажи.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИнвойсПродажиТовары.НомерСтроки КАК НомерСтроки,
	               |	ЦЕЛ(ИнвойсПродажиТовары.НомерСтроки / 2) = ИнвойсПродажиТовары.НомерСтроки / 2 КАК Чет,
	               |	ИнвойсПродажиТовары.Номенклатура КАК Номенклатура,
	               |	ИнвойсПродажиТовары.Номенклатура.Производитель КАК Производитель,
	               |	ИнвойсПродажиТовары.Количество КАК Количество,
	               |	ИнвойсПродажиТовары.Цена КАК Цена,
	               |	ИнвойсПродажиТовары.Сумма КАК Сумма,
	               |	ИнвойсПродажиТовары.Ссылка.Валюта.Символ КАК Символ
	               |ИЗ
	               |	Документ.ИнвойсПродажи.Товары КАК ИнвойсПродажиТовары
	               |ГДЕ
	               |	ИнвойсПродажиТовары.Ссылка = &Ссылка";
	Пакет = Запрос.ВыполнитьПакет();
	Шапка = Пакет[0].Выбрать();
	Шапка.Следующий();
	Товары = Пакет[1].Выбрать();
	
	глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка, );
	Пока Товары.Следующий() Цикл   
		глВывестиСекцию(ТабДокумент, Макет, ?(Товары.Чет, "СтрокаЧет", "Строка"), Товары, );
	КонецЦикла;
	глВывестиСекцию(ТабДокумент, Макет, "Дно", Шапка, );
	
КонецПроцедуры
